// Модуль: ws64_fs_exch
// Описание: Организация работы с файловой системой для обмена данными
// Автор: Валерий
// Дата создания: 2025-03-16  
// Версия: v1.0
// Зависимости:
//	Лог — модуль для ведения журнала операций (Обработки.ws64_log)
//	Утилиты — модуль с общими процедурами для работы с файлами (Обработки.ws64_util)

#Область библиотеки_экспорт 
// Перем Лог Экспорт; // Будет использовано для ведения журнала операций
#КонецОбласти   

#Область библиотеки 
 // Перем Фрм; // Ссылка на общий модуль форматов ws64_frm_КлиентСервер
#КонецОбласти

//Экспортные переменные для организации файловой инфраструктуры
#Область переменные_экспорт 
//Перем КаталогВременныхФайлов	Экспорт; // Путь к каталогу для временных файлов
//Перем КаталогОбмена				Экспорт; // Путь к каталогу для обмена данными между системами
//Перем КаталогОбработки			Экспорт; // Путь к рабочему каталогу во временной директории

//Перем ФайлОписания Экспорт; // Имя файла (без расширения) для описания пакета (инициализируется в JSON)
//Перем ФайлДанных Экспорт;   // Имя файла (без расширения) для данных (инициализируется в JSON)
//Перем ФайлТипов Экспорт;    // Имя файла (без расширения) для типов объектов данных (инициализируется в JSON)

//Перем ФайлДанныхРазмерМБ	Экспорт; // Максимальный размер файла данных в МБ (по умолчанию: 0)
#КонецОбласти

//Внутренние переменные необходимые для работы модуля
#Область переменные_внутренние 
//Перем Счетчик; // количества файлов
#КонецОбласти

#Область Конструкторы
Процедура ЗначенияПоУмолчанию()
	//// Лог = Обработки.ws64_log.Создать();
	//Фрм = ws64_frm_КлиентСервер;
	//
	//ФайлДанныхРазмерМБ = 0;
	//ФайлОписания	= "meta";
	//ФайлДанных		= "data";
	//ФайлТипов		= "type";
КонецПроцедуры
Процедура Инициализация() Экспорт
	
	//Если ЗначениеЗаполнено(КаталогВременныхФайлов) Тогда
	//	Ф = УникальныйФайл(КаталогВременныхФайлов);
	//Иначе 
	//	Ф = Новый Файл(ПолучитьИмяВременногоФайла());
	//КонецЕсли;                                        
	//КаталогОбработки = Ф.ПолноеИмя;
	//СоздатьКаталог(КаталогОбработки); 
	//
	//ФайлОписания	= Новый Файл(КаталогОбработки+"\"+ФайлОписания+".json");
	//ФайлДанных		= Новый Файл(КаталогОбработки+"\"+ФайлДанных	+".json");
	//ФайлТипов		= Новый Файл(КаталогОбработки+"\"+ФайлТипов		+".json");
	
КонецПроцедуры
// Сброс всех значений и удаление каталога обработки
Процедура Сброс() Экспорт 
	ЗначенияПоУмолчанию();
	//Ф = Новый Файл(КаталогОбработки);
	//Если Ф.Существует() Тогда
	//	УдалитьФайлы(КаталогОбработки);
	//КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область Процедуры_Экспорт 
Процедура УникальныйФайл1(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецПроцедуры   

#КонецОбласти

#Область Функции_Экспорт 
Функция УникальныйФайл2(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецФункции
#КонецОбласти 

#Область Процедуры 
Процедура УникальныйФайл3(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецПроцедуры
#КонецОбласти  

#Область Функции 
Функция УникальныйФайл4(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецФункции
#КонецОбласти

ЗначенияПоУмолчанию();
