// Модуль: ws64_state
// Описание: Счетчик
// Автор: Валерий
// Дата создания: 2025-03-16  
// Версия: v1.0
// Зависимости: НЕТ

#Область библиотеки_экспорт 
#КонецОбласти   

#Область библиотеки 
#КонецОбласти

//Экспортные переменные для организации файловой инфраструктуры
#Область переменные_экспорт 
Перем Счет Экспорт; // Значение Счетчика
Перем Макс Экспорт; // Максимум Счетчика
Перем Кратность Экспорт; // Максимум Счетчика
Перем Описание Экспорт; // Текстовое значение
Перем Файл Экспорт; // Файл со структурой состояния
Перем Состояие Экспорт; // Использовать строку состояния

#КонецОбласти

//Внутренние переменные необходимые для работы модуля
#Область переменные_внутренние 
//Перем Счетчик; // количества файлов
#КонецОбласти

#Область Конструкторы
Процедура ЗначенияПоУмолчанию()
	Счет = 0; 
	Макс = 0;
	Кратность = 100;
	Описание = "";
КонецПроцедуры
Процедура Инициализация(Максимум
	,ОписаниеСчетчика = ""
	,Начало=0
	,КратностьСчетчика=100) Экспорт
	
	Счет = Начало;
	Макс = Максимум;
	Описание = ОписаниеСчетчика;
	Кратность = КратностьСчетчика;
	
КонецПроцедуры
// Сброс всех значений
Процедура Сброс() Экспорт 
	ЗначенияПоУмолчанию();
КонецПроцедуры
#КонецОбласти

#Область Процедуры_Экспорт 
Процедура Плюс()
	Счет = Счет + 1;
КонецПроцедуры
#КонецОбласти

#Область Функции_Экспорт 
Функция Состояие() Экспорт
	Если НЕ Состояие Тогда
		Возврат;
	КонецЕсли;
	
	Если Счет%Кратность = 0 Тогда  
		Если Макс-Счет <> 0 Тогда
			СЧ = " "+Формат(Счет,"ЧГ=");
			МК = ":"+Формат(Макс,"ЧГ=");
			ДТ = ":"+Формат(Макс-Счет ,"ЧГ=")+" ";
		Иначе
			СЧ = "";
			МК = "";
			ДТ = "";
		КонецЕсли;
		стр = "" + СЧ + МК + ДТ + СокрЛП(Описание); 
	КонецЕсли;
КонецФункции

#КонецОбласти 

#Область Процедуры 
#КонецОбласти  

#Область Функции 
#КонецОбласти

ЗначенияПоУмолчанию();
