// Модуль: ws64_log
// Описание: Организация журналирования процесса 
// Автор: Валерий
// Дата создания: 2025-03-16  
// Версия: v1.0
// Зависимости:
//	НЕТ 

#Область библиотеки_экспорт 
#КонецОбласти   

#Область библиотеки 
#КонецОбласти

#Область переменные_экспорт
Перем Кэш 			Экспорт;  //Количество строк сообщений
Перем ДюрацияЧас	Экспорт;  //период хранения логов
Перем Уровень		Экспорт;  //Уровень вывода лога
Перем ВыводОкно		Экспорт;  //Вывод сообщений
Перем ВыводФайл		Экспорт;  //Файл записи лога
Перем ВыводЖурнал	Экспорт;  //запись в жухнал

Перем СтатусСостояния	Экспорт;  //вывод состояния
Перем СтатусФайл	Экспорт;  //Файл записи стояния

//формат лога
Перем ПечатьДата	Экспорт;	//Вывод Даты в сообщении
Перем ПечатьТаймер	Экспорт;	//Вывод времени исполнения
Перем ПечатьПрефикс	Экспорт;    //Вывод префикса сообщения

Перем ФайлЛог		Экспорт;
Перем ФайлСтатус	Экспорт;
#КонецОбласти

#Область переменные_внутренние 
Перем Старт;        //Время старта Таймера
Перем Сообщения;    //Кеш Строк сообщений 
Перем ЗаписьЛог;
Перем ЗаписьСтатус;

//Флажки
Перем ОбычноеПриложение;
#КонецОбласти

#Область Конструкторы
Процедура ЗначенияПоУмолчанию()	
	Кэш				= 1000;
	ДюрацияЧас		= 48;
	Уровень			= 3;
	ВыводОкно		= Ложь;
	ВыводФайл		= Ложь;
	ВыводЖурнал		= Ложь;  
	СтатусСостояния	= Ложь;  //вывод состояния
	СтатусФайл		= Ложь;  //Файл записи стояния
	
	//параметры форматной строки сообщения
	ПечатьДата		= Ложь;
	ПечатьТаймер	= Ложь;
	ПечатьПрефикс	= Ложь;
	
	ФайлЛог		= "";
	ФайлСтатус	= "";	
	
	Сообщения = "";
	ОбычноеПриложение = ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение; 
    ТаймерСброс();   
	
КонецПроцедуры
Процедура Инициализация() Экспорт
	//ОчиститьСообщения(); // нет на сервере
	ТаймерСброс();
	
	Сообщения = "";
	Если НЕ ЗначениеЗаполнено(ФайлЛог) Тогда
		ВыводФайл = Ложь;
	КонецЕсли;
	Если ВыводФайл Тогда
		Ф = Новый Файл(ФайлЛог);
		К = Новый Файл(Ф.Путь);
		
		Если  К.Существует() И К.ЭтоКаталог() Тогда
			ФайлЛогИмя = Ф.Путь+Ф.ИмяБезРасширения+"."+Формат(Старт, "ДФ=yyMMddHHmm")+Ф.Расширение;
			ЗаписьЛога = Новый ЗаписьТекста;
			ЗаписьЛога.Открыть(ФайлЛогИмя,КодировкаТекста.UTF8,Символы.ПС,Истина);
		Иначе	
			ВыводФайл = Ложь;
		КонецЕсли;
	КонецЕсли;
	УдалитьСтарыеФайлы();
	
	Если НЕ ОбычноеПриложение Тогда
		СтатусСостояния = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФайлСтатус)  Тогда
		СтатусФайл = Ложь;
	КонецЕсли;     
	Если СтатусФайл Тогда
		
		Ф = Новый Файл(ФайлСтатус);
		К = Новый Файл(Ф.Путь);
		
		Если НЕ (К.Существует() И К.ЭтоКаталог()) Тогда
			СтатусВывод = Ложь;
		КонецЕсли; 
		Если СтатусФайл Тогда
			Если Ф.Существует() Тогда
				УдалитьФайлы(Ф.ПолноеИмя);
			КонецЕсли;
			
			ЗаписьСтатус = Новый ЗаписьТекста(Ф.ПолноеИмя);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура Сброс() Экспорт
	Если ВыводФайл Тогда
		К = СтрЧислоСтрок(Сообщения);
		Если К > 0 Тогда
			Сообщения = Лев(Сообщения,СтрДлина(Сообщения)-1);
			ЗаписьЛог.ЗаписатьСтроку(Сообщения);
			Сообщения = "";
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЛога = Неопределено;
	
КонецПроцедуры
#КонецОбласти

#Область Методы
Процедура ТаймерСброс() Экспорт
	Старт = ТекущаяДата();
КонецПроцедуры


Процедура Ошибка(Текст,		Объект = Неопределено,Преф="err") Экспорт 
	Если Уровень < 1 Тогда 
		Возврат; 
	КонецЕсли;
	Лог(Текст,Объект,Преф,СтатусСообщения.ОченьВажное,УровеньЖурналаРегистрации.Ошибка);
КонецПроцедуры
Процедура Внимание(Текст,	Объект = Неопределено,Преф="wrn") Экспорт
	Если Уровень < 2 Тогда 
		Возврат; 
	КонецЕсли;
	Лог(Текст,Объект,Преф,СтатусСообщения.Внимание,УровеньЖурналаРегистрации.Предупреждение);
КонецПроцедуры
Процедура Инфо(Текст,		Объект = Неопределено,Преф="inf") Экспорт
	Если Уровень < 3 Тогда 
		Возврат; 
	КонецЕсли;
	Лог(Текст,Объект,Преф,СтатусСообщения.Информация,УровеньЖурналаРегистрации.Информация);
КонецПроцедуры
Процедура Отладка(Текст,	Объект = Неопределено,Преф="dbg") Экспорт
	Если Уровень < 4 Тогда 
		Возврат; 
	КонецЕсли;
	Лог(Текст,Объект,Преф,СтатусСообщения.Важное,УровеньЖурналаРегистрации.Примечание);
КонецПроцедуры
Процедура Трасса(Текст,		Объект = Неопределено,Преф="trc") Экспорт
	Если Уровень < 5 Тогда 
		Возврат; 
	КонецЕсли;
	Лог(Текст,Объект,Преф,СтатусСообщения.Обычное,УровеньЖурналаРегистрации.Примечание);
КонецПроцедуры

Процедура ПоказатьЛог() Экспорт

КонецПроцедуры
Процедура ПоказатьСтатус() Экспорт

КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_функции
Процедура Лог(Текст,Объект=Неопределено,Преф="",ст = Неопределено,жр=Неопределено)
	стс = ?(ст = Неопределено,СтатусСообщения.БезСтатуса,			ст);
	ужр = ?(жр = Неопределено,УровеньЖурналаРегистрации.Примечание,	жр);
	
	Если ТипЗнч(Текст) = Тип("ИнформацияОбОшибке") Тогда
		инф 
		= НСтр("ru='Описание=';en='Description='")		+ Текст.Описание 		+ Символы.ПС
		+ НСтр("ru='ИмяМодуля=';en='ModuleName='")		+ Текст.ИмяМодуля		+ Символы.ПС
		+ НСтр("ru='НомерСтроки=';en='LineNumber='")	+ Текст.НомерСтроки		+ Символы.ПС
		+ НСтр("ru='ИсходнаяСтрока=';en='SourceLine='") + Текст.ИсходнаяСтрока	+ Символы.ПС;
		Текст = инф;
	КонецЕсли;
	
	Если ВыводОкно Тогда
		Если ОбычноеПриложение Тогда
			Сообщить(Формат_сообщения(Преф,Текст),стс);
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Текст;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если ВыводФайл Тогда
		Сообщения = Сообщение +	Формат_сообщения(Преф,Текст) + Символы.ПС;
		К = СтрЧислоСтрок(Сообщения);
		Если К > Кэш Тогда
			Сообщения = Лев(Сообщения,СтрДлина(Сообщения)-1);
			ЗаписьЛог.ЗаписатьСтроку(Сообщения);
			Сообщения = "";
		КонецЕсли;
	КонецЕсли;
	Если ВыводЖурнал Тогда        
		Событие = ?(ЗначениеЗаполнено(Преф),Преф,"log");
		ЗаписьЖурналаРегистрации(Событие,ужр,Объект.Метаданные(),Объект,Текст,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	КонецЕсли;
	
	
КонецПроцедуры
Процедура УдалитьСтарыеФайлы()
	Если НЕ ВыводФайл Тогда
		Возврат;
	КонецЕсли;
	Д = ДюрацияЧас * 60 * 60;
	Ф = Новый Файл(ФайлЛог);
	
	М = НайтиФайлы(Ф.Путь,Ф.ИмяБезРасширения+"*."+Ф.Расширение);
	
	Для Каждого Ф ИЗ М Цикл
		Если Ф.ЭтоКаталог() Тогда 
			Продолжить;
		КонецЕсли;
		Если ТекущаяДата() - Ф.ПолучитьВремяИзменения() > Д Тогда
			УдалитьФайлы(Ф.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;     
КонецПроцедуры

Функция	Таймер()
	Т = ТекущаяДата() - Старт;
	Ч = Цел(Т/3600);
	М = Цел(Т%3600/60);
	С = Т%3600%60;
	Ф0 = "ЧДЦ=0; ЧН=; ЧГ=";
	Ф2 = "ЧЦ=2; ЧДЦ=0; ЧН=; ЧВН=";
	Возврат Формат(Ч,Ф0)+":"+Формат(М,Ф2)+":"+Формат(С,Ф2);
КонецФункции
Функция Формат_сообщения(Преф="",Текст) 
	Возврат ""
	+ ?(ПечатьДата,					Формат(ТекущаяДата(),"ДФ=HH.mm.ss")+" ","") 
	+ ?(ПечатьТаймер,				Таймер()+ " ","") 
	+ ?(ЗначениеЗаполнено(Преф),	Преф+" ","") 
	+ Текст; 
КонецФункции
#КонецОбласти


#Область Основная_программа 
//выполняется при создании объекта

ЗначенияПоУмолчанию(); 
#КонецОбласти
