// Модуль: ws64_sender
// Описание: Экспорт данных
// Автор: Валерий
// Дата создания: 2025-03-16  
// Версия: v1.0
// Зависимости:
//	Лог — модуль для ведения журнала операций (Обработки.ws64_log)

#Область библиотеки_экспорт 
Перем Лог Экспорт;	// для ведения журнала операций
Перем ФС Экспорт; 	// Файловая система обмена
Перем Правила Экспорт; //Правила выгрузки
#КонецОбласти   

#Область библиотеки 
 // Перем Фрм; // Ссылка на общий модуль форматов ws64_frm_КлиентСервер
#КонецОбласти

//Экспортные переменные для организации файловой инфраструктуры
#Область переменные_экспорт 
//Перем КаталогВременныхФайлов	Экспорт; // Путь к каталогу для временных файлов
//Перем КаталогОбмена				Экспорт; // Путь к каталогу для обмена данными между системами
//Перем КаталогОбработки			Экспорт; // Путь к рабочему каталогу во временной директории

//Перем ФайлОписания Экспорт; // Имя файла (без расширения) для описания пакета (инициализируется в JSON)
//Перем ФайлДанных Экспорт;   // Имя файла (без расширения) для данных (инициализируется в JSON)
//Перем ФайлТипов Экспорт;    // Имя файла (без расширения) для типов объектов данных (инициализируется в JSON)

//Перем ФайлДанныхРазмерМБ	Экспорт; // Максимальный размер файла данных в МБ (по умолчанию: 0)
#КонецОбласти

//Внутренние переменные необходимые для работы модуля
#Область переменные_внутренние 
//Перем Счетчик; // количества файлов
#КонецОбласти

#Область Конструкторы
Процедура ЗначенияПоУмолчанию()
	Журнал	= Обработки.ws64_log.Создать();
	Файлы	= Обработки.ws64_fs_exch.Создать();
    Статус	= Обработки.ws64_state.Создать();
	Правила = Обработки.ws64_rls_exp.Создать(); 
	Журнал = Обработки.ws64_log1.Создать();
	Журнал.ФайлВывода("C:\tmp.log");
	Журнал.
	
	;
КонецПроцедуры
Процедура Инициализация() Экспорт
	Лог.ВыводВОкно = Истина;
	Лог.Инициализация();
	ФС.КаталогВременныхФайлов = Неопределено;
	ФС.Инициализация();
	
КонецПроцедуры
// Сброс всех значений 
Процедура Сброс() Экспорт 

	ФС.Сброс();
	Лог.Сброс();
	
	ЗначенияПоУмолчанию();
	
КонецПроцедуры
#КонецОбласти

#Область Экспортные_Процедуры 
Процедура Отправить() Экспорт
	
КонецПроцедуры   

#КонецОбласти

#Область Экспортные_Функции 
Функция УникальныйФайл2(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецФункции
#КонецОбласти 

#Область Внутренние_Процедуры 

Процедура УникальныйФайл3(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Внутренние_Функции 
Функция УникальныйФайл4(Каталог,Префикс="",Расширение="tmp") Экспорт
	
КонецФункции
#КонецОбласти

ЗначенияПоУмолчанию();
